; domain
(define (domain grid-visitAll)
(:requirements :strips :typing :negative-preconditions)
(:types
place - object
)
(:predicates
	(at-robot ?x1 - place)
	(visited ?x1 - place)
	(connected ?x1 - place ?x2 - place)
)
(:action move
	:parameters (?x1 - place ?x2 - place )
	:precondition (and
	(not(at-robot ?x2))
	(at-robot ?x1)
	(connected ?x1 ?x2))
	:effect (and
	(at-robot ?x2)
	(not(at-robot ?x1)))
)
(:action visit
	:parameters (?x1 - place )
	:precondition (and
	(at-robot ?x1)
	(not(visited ?x1)))
	:effect (and
	(visited ?x1))
)
)

; problem
(define (problem grid-6)
(:domain grid-visitAll)
(:objects
	loc-x0-y0
	loc-x0-y1
	loc-x0-y2
	loc-x0-y3
	loc-x0-y4
	loc-x0-y5
	loc-x1-y0
	loc-x1-y1
	loc-x1-y2
	loc-x1-y3
	loc-x1-y4
	loc-x1-y5
	loc-x2-y0
	loc-x2-y1
	loc-x2-y2
	loc-x2-y3
	loc-x2-y4
	loc-x2-y5
	loc-x3-y0
	loc-x3-y1
	loc-x3-y2
	loc-x3-y3
	loc-x3-y4
	loc-x3-y5
	loc-x4-y0
	loc-x4-y1
	loc-x4-y2
	loc-x4-y3
	loc-x4-y4
	loc-x4-y5
	loc-x5-y0
	loc-x5-y1
	loc-x5-y2
	loc-x5-y3
	loc-x5-y4
	loc-x5-y5
- place

)
(:init
	(at-robot loc-x3-y3)
	(visited loc-x3-y3)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x0-y1 loc-x0-y2)
 	(connected loc-x0-y2 loc-x1-y2)
 	(connected loc-x0-y2 loc-x0-y1)
 	(connected loc-x0-y2 loc-x0-y3)
 	(connected loc-x0-y3 loc-x1-y3)
 	(connected loc-x0-y3 loc-x0-y2)
 	(connected loc-x0-y3 loc-x0-y4)
 	(connected loc-x0-y4 loc-x1-y4)
 	(connected loc-x0-y4 loc-x0-y3)
 	(connected loc-x0-y4 loc-x0-y5)
 	(connected loc-x0-y5 loc-x1-y5)
 	(connected loc-x0-y5 loc-x0-y4)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x2-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x2-y1)
 	(connected loc-x1-y1 loc-x1-y0)
 	(connected loc-x1-y1 loc-x1-y2)
 	(connected loc-x1-y2 loc-x0-y2)
 	(connected loc-x1-y2 loc-x2-y2)
 	(connected loc-x1-y2 loc-x1-y1)
 	(connected loc-x1-y2 loc-x1-y3)
 	(connected loc-x1-y3 loc-x0-y3)
 	(connected loc-x1-y3 loc-x2-y3)
 	(connected loc-x1-y3 loc-x1-y2)
 	(connected loc-x1-y3 loc-x1-y4)
 	(connected loc-x1-y4 loc-x0-y4)
 	(connected loc-x1-y4 loc-x2-y4)
 	(connected loc-x1-y4 loc-x1-y3)
 	(connected loc-x1-y4 loc-x1-y5)
 	(connected loc-x1-y5 loc-x0-y5)
 	(connected loc-x1-y5 loc-x2-y5)
 	(connected loc-x1-y5 loc-x1-y4)
 	(connected loc-x2-y0 loc-x1-y0)
 	(connected loc-x2-y0 loc-x3-y0)
 	(connected loc-x2-y0 loc-x2-y1)
 	(connected loc-x2-y1 loc-x1-y1)
 	(connected loc-x2-y1 loc-x3-y1)
 	(connected loc-x2-y1 loc-x2-y0)
 	(connected loc-x2-y1 loc-x2-y2)
 	(connected loc-x2-y2 loc-x1-y2)
 	(connected loc-x2-y2 loc-x3-y2)
 	(connected loc-x2-y2 loc-x2-y1)
 	(connected loc-x2-y2 loc-x2-y3)
 	(connected loc-x2-y3 loc-x1-y3)
 	(connected loc-x2-y3 loc-x3-y3)
 	(connected loc-x2-y3 loc-x2-y2)
 	(connected loc-x2-y3 loc-x2-y4)
 	(connected loc-x2-y4 loc-x1-y4)
 	(connected loc-x2-y4 loc-x3-y4)
 	(connected loc-x2-y4 loc-x2-y3)
 	(connected loc-x2-y4 loc-x2-y5)
 	(connected loc-x2-y5 loc-x1-y5)
 	(connected loc-x2-y5 loc-x3-y5)
 	(connected loc-x2-y5 loc-x2-y4)
 	(connected loc-x3-y0 loc-x2-y0)
 	(connected loc-x3-y0 loc-x4-y0)
 	(connected loc-x3-y0 loc-x3-y1)
 	(connected loc-x3-y1 loc-x2-y1)
 	(connected loc-x3-y1 loc-x4-y1)
 	(connected loc-x3-y1 loc-x3-y0)
 	(connected loc-x3-y1 loc-x3-y2)
 	(connected loc-x3-y2 loc-x2-y2)
 	(connected loc-x3-y2 loc-x4-y2)
 	(connected loc-x3-y2 loc-x3-y1)
 	(connected loc-x3-y2 loc-x3-y3)
 	(connected loc-x3-y3 loc-x2-y3)
 	(connected loc-x3-y3 loc-x4-y3)
 	(connected loc-x3-y3 loc-x3-y2)
 	(connected loc-x3-y3 loc-x3-y4)
 	(connected loc-x3-y4 loc-x2-y4)
 	(connected loc-x3-y4 loc-x4-y4)
 	(connected loc-x3-y4 loc-x3-y3)
 	(connected loc-x3-y4 loc-x3-y5)
 	(connected loc-x3-y5 loc-x2-y5)
 	(connected loc-x3-y5 loc-x4-y5)
 	(connected loc-x3-y5 loc-x3-y4)
 	(connected loc-x4-y0 loc-x3-y0)
 	(connected loc-x4-y0 loc-x5-y0)
 	(connected loc-x4-y0 loc-x4-y1)
 	(connected loc-x4-y1 loc-x3-y1)
 	(connected loc-x4-y1 loc-x5-y1)
 	(connected loc-x4-y1 loc-x4-y0)
 	(connected loc-x4-y1 loc-x4-y2)
 	(connected loc-x4-y2 loc-x3-y2)
 	(connected loc-x4-y2 loc-x5-y2)
 	(connected loc-x4-y2 loc-x4-y1)
 	(connected loc-x4-y2 loc-x4-y3)
 	(connected loc-x4-y3 loc-x3-y3)
 	(connected loc-x4-y3 loc-x5-y3)
 	(connected loc-x4-y3 loc-x4-y2)
 	(connected loc-x4-y3 loc-x4-y4)
 	(connected loc-x4-y4 loc-x3-y4)
 	(connected loc-x4-y4 loc-x5-y4)
 	(connected loc-x4-y4 loc-x4-y3)
 	(connected loc-x4-y4 loc-x4-y5)
 	(connected loc-x4-y5 loc-x3-y5)
 	(connected loc-x4-y5 loc-x5-y5)
 	(connected loc-x4-y5 loc-x4-y4)
 	(connected loc-x5-y0 loc-x4-y0)
 	(connected loc-x5-y0 loc-x5-y1)
 	(connected loc-x5-y1 loc-x4-y1)
 	(connected loc-x5-y1 loc-x5-y0)
 	(connected loc-x5-y1 loc-x5-y2)
 	(connected loc-x5-y2 loc-x4-y2)
 	(connected loc-x5-y2 loc-x5-y1)
 	(connected loc-x5-y2 loc-x5-y3)
 	(connected loc-x5-y3 loc-x4-y3)
 	(connected loc-x5-y3 loc-x5-y2)
 	(connected loc-x5-y3 loc-x5-y4)
 	(connected loc-x5-y4 loc-x4-y4)
 	(connected loc-x5-y4 loc-x5-y3)
 	(connected loc-x5-y4 loc-x5-y5)
 	(connected loc-x5-y5 loc-x4-y5)
 	(connected loc-x5-y5 loc-x5-y4)

)
(:goal
(and
	(visited loc-x0-y0)
	(visited loc-x0-y1)
	(visited loc-x0-y2)
	(visited loc-x0-y3)
	(visited loc-x0-y4)
	(visited loc-x0-y5)
	(visited loc-x1-y0)
	(visited loc-x1-y1)
	(visited loc-x1-y2)
	(visited loc-x1-y3)
	(visited loc-x1-y4)
	(visited loc-x1-y5)
	(visited loc-x2-y0)
	(visited loc-x2-y1)
	(visited loc-x2-y2)
	(visited loc-x2-y3)
	(visited loc-x2-y4)
	(visited loc-x2-y5)
	(visited loc-x3-y0)
	(visited loc-x3-y1)
	(visited loc-x3-y2)
	(visited loc-x3-y3)
	(visited loc-x3-y4)
	(visited loc-x3-y5)
	(visited loc-x4-y0)
	(visited loc-x4-y1)
	(visited loc-x4-y2)
	(visited loc-x4-y3)
	(visited loc-x4-y4)
	(visited loc-x4-y5)
	(visited loc-x5-y0)
	(visited loc-x5-y1)
	(visited loc-x5-y2)
	(visited loc-x5-y3)
	(visited loc-x5-y4)
	(visited loc-x5-y5)
)
)
)

; plan
1. (move loc-x3-y3 loc-x2-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x2-y3)
   goals met: 1 of 36
2. (move loc-x2-y3 loc-x2-y2)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y2)
   goals met: 1 of 36
3. (visit loc-x2-y2)
   added: (visited loc-x2-y2)
   goals met: 2 of 36
4. (move loc-x2-y2 loc-x1-y2)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x1-y2)
   goals met: 2 of 36
5. (move loc-x1-y2 loc-x0-y2)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x0-y2)
   goals met: 2 of 36
6. (visit loc-x0-y2)
   added: (visited loc-x0-y2)
   goals met: 3 of 36
7. (move loc-x0-y2 loc-x1-y2)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x1-y2)
   goals met: 3 of 36
8. (move loc-x1-y2 loc-x1-y1)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y1)
   goals met: 3 of 36
9. (visit loc-x1-y1)
   added: (visited loc-x1-y1)
   goals met: 4 of 36
10. (move loc-x1-y1 loc-x1-y0)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y0)
   goals met: 4 of 36
11. (visit loc-x1-y0)
   added: (visited loc-x1-y0)
   goals met: 5 of 36
12. (move loc-x1-y0 loc-x1-y1)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x1-y1)
   goals met: 5 of 36
13. (move loc-x1-y1 loc-x2-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x2-y1)
   goals met: 5 of 36
14. (visit loc-x2-y1)
   added: (visited loc-x2-y1)
   goals met: 6 of 36
15. (move loc-x2-y1 loc-x2-y2)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x2-y2)
   goals met: 6 of 36
16. (move loc-x2-y2 loc-x3-y2)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x3-y2)
   goals met: 6 of 36
17. (visit loc-x3-y2)
   added: (visited loc-x3-y2)
   goals met: 7 of 36
18. (move loc-x3-y2 loc-x2-y2)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x2-y2)
   goals met: 7 of 36
19. (move loc-x2-y2 loc-x2-y3)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y3)
   goals met: 7 of 36
20. (visit loc-x2-y3)
   added: (visited loc-x2-y3)
   goals met: 8 of 36
21. (move loc-x2-y3 loc-x1-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x1-y3)
   goals met: 8 of 36
22. (move loc-x1-y3 loc-x1-y2)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x1-y2)
   goals met: 8 of 36
23. (visit loc-x1-y2)
   added: (visited loc-x1-y2)
   goals met: 9 of 36
24. (move loc-x1-y2 loc-x1-y1)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y1)
   goals met: 9 of 36
25. (move loc-x1-y1 loc-x0-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x0-y1)
   goals met: 9 of 36
26. (visit loc-x0-y1)
   added: (visited loc-x0-y1)
   goals met: 10 of 36
27. (move loc-x0-y1 loc-x0-y2)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x0-y2)
   goals met: 10 of 36
28. (move loc-x0-y2 loc-x1-y2)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x1-y2)
   goals met: 10 of 36
29. (move loc-x1-y2 loc-x1-y3)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y3)
   goals met: 10 of 36
30. (move loc-x1-y3 loc-x2-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x2-y3)
   goals met: 10 of 36
31. (move loc-x2-y3 loc-x2-y4)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y4)
   goals met: 10 of 36
32. (visit loc-x2-y4)
   added: (visited loc-x2-y4)
   goals met: 11 of 36
33. (move loc-x2-y4 loc-x3-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x3-y4)
   goals met: 11 of 36
34. (move loc-x3-y4 loc-x3-y5)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x3-y5)
   goals met: 11 of 36
35. (visit loc-x3-y5)
   added: (visited loc-x3-y5)
   goals met: 12 of 36
36. (move loc-x3-y5 loc-x3-y4)
   deleted: (at-robot loc-x3-y5)
   added: (at-robot loc-x3-y4)
   goals met: 12 of 36
37. (move loc-x3-y4 loc-x4-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x4-y4)
   goals met: 12 of 36
38. (visit loc-x4-y4)
   added: (visited loc-x4-y4)
   goals met: 13 of 36
39. (move loc-x4-y4 loc-x3-y4)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x3-y4)
   goals met: 13 of 36
40. (move loc-x3-y4 loc-x2-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x2-y4)
   goals met: 13 of 36
41. (move loc-x2-y4 loc-x2-y3)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x2-y3)
   goals met: 13 of 36
42. (move loc-x2-y3 loc-x1-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x1-y3)
   goals met: 13 of 36
43. (visit loc-x1-y3)
   added: (visited loc-x1-y3)
   goals met: 14 of 36
44. (move loc-x1-y3 loc-x1-y4)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x1-y4)
   goals met: 14 of 36
45. (visit loc-x1-y4)
   added: (visited loc-x1-y4)
   goals met: 15 of 36
46. (move loc-x1-y4 loc-x0-y4)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x0-y4)
   goals met: 15 of 36
47. (visit loc-x0-y4)
   added: (visited loc-x0-y4)
   goals met: 16 of 36
48. (move loc-x0-y4 loc-x1-y4)
   deleted: (at-robot loc-x0-y4)
   added: (at-robot loc-x1-y4)
   goals met: 16 of 36
49. (move loc-x1-y4 loc-x1-y3)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x1-y3)
   goals met: 16 of 36
50. (move loc-x1-y3 loc-x2-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x2-y3)
   goals met: 16 of 36
51. (move loc-x2-y3 loc-x2-y4)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y4)
   goals met: 16 of 36
52. (move loc-x2-y4 loc-x2-y5)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x2-y5)
   goals met: 16 of 36
53. (visit loc-x2-y5)
   added: (visited loc-x2-y5)
   goals met: 17 of 36
54. (move loc-x2-y5 loc-x2-y4)
   deleted: (at-robot loc-x2-y5)
   added: (at-robot loc-x2-y4)
   goals met: 17 of 36
55. (move loc-x2-y4 loc-x3-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x3-y4)
   goals met: 17 of 36
56. (visit loc-x3-y4)
   added: (visited loc-x3-y4)
   goals met: 18 of 36
57. (move loc-x3-y4 loc-x4-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x4-y4)
   goals met: 18 of 36
58. (move loc-x4-y4 loc-x4-y3)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x4-y3)
   goals met: 18 of 36
59. (visit loc-x4-y3)
   added: (visited loc-x4-y3)
   goals met: 19 of 36
60. (move loc-x4-y3 loc-x4-y4)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x4-y4)
   goals met: 19 of 36
61. (move loc-x4-y4 loc-x3-y4)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x3-y4)
   goals met: 19 of 36
62. (move loc-x3-y4 loc-x2-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x2-y4)
   goals met: 19 of 36
63. (move loc-x2-y4 loc-x2-y3)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x2-y3)
   goals met: 19 of 36
64. (move loc-x2-y3 loc-x1-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x1-y3)
   goals met: 19 of 36
65. (move loc-x1-y3 loc-x0-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x0-y3)
   goals met: 19 of 36
66. (visit loc-x0-y3)
   added: (visited loc-x0-y3)
   goals met: 20 of 36
67. (move loc-x0-y3 loc-x1-y3)
   deleted: (at-robot loc-x0-y3)
   added: (at-robot loc-x1-y3)
   goals met: 20 of 36
68. (move loc-x1-y3 loc-x2-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x2-y3)
   goals met: 20 of 36
69. (move loc-x2-y3 loc-x2-y4)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y4)
   goals met: 20 of 36
70. (move loc-x2-y4 loc-x2-y5)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x2-y5)
   goals met: 20 of 36
71. (move loc-x2-y5 loc-x3-y5)
   deleted: (at-robot loc-x2-y5)
   added: (at-robot loc-x3-y5)
   goals met: 20 of 36
72. (move loc-x3-y5 loc-x4-y5)
   deleted: (at-robot loc-x3-y5)
   added: (at-robot loc-x4-y5)
   goals met: 20 of 36
73. (move loc-x4-y5 loc-x5-y5)
   deleted: (at-robot loc-x4-y5)
   added: (at-robot loc-x5-y5)
   goals met: 20 of 36
74. (visit loc-x5-y5)
   added: (visited loc-x5-y5)
   goals met: 21 of 36
75. (move loc-x5-y5 loc-x4-y5)
   deleted: (at-robot loc-x5-y5)
   added: (at-robot loc-x4-y5)
   goals met: 21 of 36
76. (visit loc-x4-y5)
   added: (visited loc-x4-y5)
   goals met: 22 of 36
77. (move loc-x4-y5 loc-x3-y5)
   deleted: (at-robot loc-x4-y5)
   added: (at-robot loc-x3-y5)
   goals met: 22 of 36
78. (move loc-x3-y5 loc-x3-y4)
   deleted: (at-robot loc-x3-y5)
   added: (at-robot loc-x3-y4)
   goals met: 22 of 36
79. (move loc-x3-y4 loc-x2-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x2-y4)
   goals met: 22 of 36
80. (move loc-x2-y4 loc-x2-y3)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x2-y3)
   goals met: 22 of 36
81. (move loc-x2-y3 loc-x2-y2)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y2)
   goals met: 22 of 36
82. (move loc-x2-y2 loc-x2-y1)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y1)
   goals met: 22 of 36
83. (move loc-x2-y1 loc-x2-y0)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x2-y0)
   goals met: 22 of 36
84. (move loc-x2-y0 loc-x3-y0)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x3-y0)
   goals met: 22 of 36
85. (visit loc-x3-y0)
   added: (visited loc-x3-y0)
   goals met: 23 of 36
86. (move loc-x3-y0 loc-x2-y0)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x2-y0)
   goals met: 23 of 36
87. (visit loc-x2-y0)
   added: (visited loc-x2-y0)
   goals met: 24 of 36
88. (move loc-x2-y0 loc-x1-y0)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x1-y0)
   goals met: 24 of 36
89. (move loc-x1-y0 loc-x1-y1)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x1-y1)
   goals met: 24 of 36
90. (move loc-x1-y1 loc-x1-y2)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y2)
   goals met: 24 of 36
91. (move loc-x1-y2 loc-x1-y3)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y3)
   goals met: 24 of 36
92. (move loc-x1-y3 loc-x2-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x2-y3)
   goals met: 24 of 36
93. (move loc-x2-y3 loc-x2-y4)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y4)
   goals met: 24 of 36
94. (move loc-x2-y4 loc-x3-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x3-y4)
   goals met: 24 of 36
95. (move loc-x3-y4 loc-x4-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x4-y4)
   goals met: 24 of 36
96. (move loc-x4-y4 loc-x5-y4)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x5-y4)
   goals met: 24 of 36
97. (visit loc-x5-y4)
   added: (visited loc-x5-y4)
   goals met: 25 of 36
98. (move loc-x5-y4 loc-x4-y4)
   deleted: (at-robot loc-x5-y4)
   added: (at-robot loc-x4-y4)
   goals met: 25 of 36
99. (move loc-x4-y4 loc-x3-y4)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x3-y4)
   goals met: 25 of 36
100. (move loc-x3-y4 loc-x3-y3)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x3-y3)
   goals met: 25 of 36
101. (move loc-x3-y3 loc-x2-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x2-y3)
   goals met: 25 of 36
102. (move loc-x2-y3 loc-x2-y2)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y2)
   goals met: 25 of 36
103. (move loc-x2-y2 loc-x2-y1)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y1)
   goals met: 25 of 36
104. (move loc-x2-y1 loc-x1-y1)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x1-y1)
   goals met: 25 of 36
105. (move loc-x1-y1 loc-x1-y0)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y0)
   goals met: 25 of 36
106. (move loc-x1-y0 loc-x0-y0)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x0-y0)
   goals met: 25 of 36
107. (visit loc-x0-y0)
   added: (visited loc-x0-y0)
   goals met: 26 of 36
108. (move loc-x0-y0 loc-x0-y1)
   deleted: (at-robot loc-x0-y0)
   added: (at-robot loc-x0-y1)
   goals met: 26 of 36
109. (move loc-x0-y1 loc-x1-y1)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x1-y1)
   goals met: 26 of 36
110. (move loc-x1-y1 loc-x2-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x2-y1)
   goals met: 26 of 36
111. (move loc-x2-y1 loc-x3-y1)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x3-y1)
   goals met: 26 of 36
112. (move loc-x3-y1 loc-x4-y1)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x4-y1)
   goals met: 26 of 36
113. (visit loc-x4-y1)
   added: (visited loc-x4-y1)
   goals met: 27 of 36
114. (move loc-x4-y1 loc-x3-y1)
   deleted: (at-robot loc-x4-y1)
   added: (at-robot loc-x3-y1)
   goals met: 27 of 36
115. (visit loc-x3-y1)
   added: (visited loc-x3-y1)
   goals met: 28 of 36
116. (move loc-x3-y1 loc-x3-y2)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x3-y2)
   goals met: 28 of 36
117. (move loc-x3-y2 loc-x3-y3)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x3-y3)
   goals met: 28 of 36
118. (move loc-x3-y3 loc-x3-y4)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y4)
   goals met: 28 of 36
119. (move loc-x3-y4 loc-x4-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x4-y4)
   goals met: 28 of 36
120. (move loc-x4-y4 loc-x4-y3)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x4-y3)
   goals met: 28 of 36
121. (move loc-x4-y3 loc-x5-y3)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x5-y3)
   goals met: 28 of 36
122. (move loc-x5-y3 loc-x5-y2)
   deleted: (at-robot loc-x5-y3)
   added: (at-robot loc-x5-y2)
   goals met: 28 of 36
123. (visit loc-x5-y2)
   added: (visited loc-x5-y2)
   goals met: 29 of 36
124. (move loc-x5-y2 loc-x5-y3)
   deleted: (at-robot loc-x5-y2)
   added: (at-robot loc-x5-y3)
   goals met: 29 of 36
125. (visit loc-x5-y3)
   added: (visited loc-x5-y3)
   goals met: 30 of 36
126. (move loc-x5-y3 loc-x4-y3)
   deleted: (at-robot loc-x5-y3)
   added: (at-robot loc-x4-y3)
   goals met: 30 of 36
127. (move loc-x4-y3 loc-x4-y2)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x4-y2)
   goals met: 30 of 36
128. (move loc-x4-y2 loc-x3-y2)
   deleted: (at-robot loc-x4-y2)
   added: (at-robot loc-x3-y2)
   goals met: 30 of 36
129. (move loc-x3-y2 loc-x3-y1)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x3-y1)
   goals met: 30 of 36
130. (move loc-x3-y1 loc-x4-y1)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x4-y1)
   goals met: 30 of 36
131. (move loc-x4-y1 loc-x4-y0)
   deleted: (at-robot loc-x4-y1)
   added: (at-robot loc-x4-y0)
   goals met: 30 of 36
132. (move loc-x4-y0 loc-x5-y0)
   deleted: (at-robot loc-x4-y0)
   added: (at-robot loc-x5-y0)
   goals met: 30 of 36
133. (visit loc-x5-y0)
   added: (visited loc-x5-y0)
   goals met: 31 of 36
134. (move loc-x5-y0 loc-x4-y0)
   deleted: (at-robot loc-x5-y0)
   added: (at-robot loc-x4-y0)
   goals met: 31 of 36
135. (visit loc-x4-y0)
   added: (visited loc-x4-y0)
   goals met: 32 of 36
136. (move loc-x4-y0 loc-x4-y1)
   deleted: (at-robot loc-x4-y0)
   added: (at-robot loc-x4-y1)
   goals met: 32 of 36
137. (move loc-x4-y1 loc-x4-y2)
   deleted: (at-robot loc-x4-y1)
   added: (at-robot loc-x4-y2)
   goals met: 32 of 36
138. (move loc-x4-y2 loc-x3-y2)
   deleted: (at-robot loc-x4-y2)
   added: (at-robot loc-x3-y2)
   goals met: 32 of 36
139. (move loc-x3-y2 loc-x3-y3)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x3-y3)
   goals met: 32 of 36
140. (move loc-x3-y3 loc-x2-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x2-y3)
   goals met: 32 of 36
141. (move loc-x2-y3 loc-x2-y4)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y4)
   goals met: 32 of 36
142. (move loc-x2-y4 loc-x1-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x1-y4)
   goals met: 32 of 36
143. (move loc-x1-y4 loc-x1-y5)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x1-y5)
   goals met: 32 of 36
144. (visit loc-x1-y5)
   added: (visited loc-x1-y5)
   goals met: 33 of 36
145. (move loc-x1-y5 loc-x0-y5)
   deleted: (at-robot loc-x1-y5)
   added: (at-robot loc-x0-y5)
   goals met: 33 of 36
146. (visit loc-x0-y5)
   added: (visited loc-x0-y5)
   goals met: 34 of 36
147. (move loc-x0-y5 loc-x1-y5)
   deleted: (at-robot loc-x0-y5)
   added: (at-robot loc-x1-y5)
   goals met: 34 of 36
148. (move loc-x1-y5 loc-x2-y5)
   deleted: (at-robot loc-x1-y5)
   added: (at-robot loc-x2-y5)
   goals met: 34 of 36
149. (move loc-x2-y5 loc-x2-y4)
   deleted: (at-robot loc-x2-y5)
   added: (at-robot loc-x2-y4)
   goals met: 34 of 36
150. (move loc-x2-y4 loc-x3-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x3-y4)
   goals met: 34 of 36
151. (move loc-x3-y4 loc-x3-y3)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x3-y3)
   goals met: 34 of 36
152. (move loc-x3-y3 loc-x4-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x4-y3)
   goals met: 34 of 36
153. (move loc-x4-y3 loc-x4-y2)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x4-y2)
   goals met: 34 of 36
154. (visit loc-x4-y2)
   added: (visited loc-x4-y2)
   goals met: 35 of 36
155. (move loc-x4-y2 loc-x5-y2)
   deleted: (at-robot loc-x4-y2)
   added: (at-robot loc-x5-y2)
   goals met: 35 of 36
156. (move loc-x5-y2 loc-x5-y1)
   deleted: (at-robot loc-x5-y2)
   added: (at-robot loc-x5-y1)
   goals met: 35 of 36
157. (visit loc-x5-y1)
   added: (visited loc-x5-y1)
   goals met: 36 of 36
